---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralSectionZprofileBottomFlangeLength
source: html/03bb8e45-f73a-9ae5-eebb-cf84f3c0704f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralSectionZprofileBottomFlangeLength Property

"Bottom Flange Length"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralSectionZprofileBottomFlangeLength { get; }
```